Repository: 84000/data-translation-memory
Catalog: toh181-v4.tmx
Source language: bo
Languages: en

source: །བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཉིན་གཅིག་བཞིན་དུ་རྣམ་པར་འཕེལ་ལོ། །དེ་དག་ནི་ཚུལ་ཁྲིམས་དེ་ཙམ་ཉི་ཚེ་དང་ལྡན་པ་ཡིན་ནོ།
en: The perfection of discipline of the bodhisattvas will increase day by day while the hearers, on the other hand, will only possess a little discipline. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན། མི་ཞིག་གིས་ཤིང་བསྐྱེད་ལ་ཤིང་བསྐྱེད་ནས་དུས་དུས་སུ་བྱི་དོར་བྱེད་ཅིང་ཆུས་བྲན་ན་ཇི་ལྟ་ཇི་ལྟར་བྱི་དོར་བྱེད་ཅིང་ཆུས་བྲན་པ་དེ་ལྟ་དེ་ལྟར་ཆུ་ཞེང་དང་འཕང་དུ་སྐྱེ་བར་འགྱུར་རོ།
en: Venerable Pūrṇa, as an analogy, if a man plants a tree, he should clear the area around it and water the tree. The more he does so, the more the tree will grow in both width and height.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་གལ་ཏེ་ཉན་ཐོས་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་འདོམས་ཤིང་རྗེས་སུ་སྟོན་ན། ཇི་ལྟ་ཇི་ལྟར་ཉན་ཐོས་དཔག་ཏུ་མེད་པ་རྣམས་བྱང་ཆུབ་སེམས་དཔའ་ལ་འདོམས་ཤིང་རྗེས་སུ་སྟོན་པ་དེ་ལྟ་དེ་ལྟར། བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་འཕེལ་ལོ།
en: Venerable Pūrṇa, likewise, when limitless hearers instruct and teach the perfection of discipline to bodhisattvas, the bodhisattvas’ perfection of discipline only increases the more they instruct and teach them.

source: །ཇི་ལྟ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་འཕེལ་བ་དེ་ལྟ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔས་འདི་ལྟ་སྟེ།
en: The more their discipline increases, the more the bodhisattvas dedicate the perfection of discipline toward attaining omniscience.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བས་ཉན་ཐོས་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་ཅིང་སྣང་བར་བྱས་ནས།
en: In this way they surpass and outshine all the hearers and assimilate the perfection of discipline.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ། འདི་ལྟ་སྟེ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བས་གང་དག་དེ་ལ་འདོམས་ཤིང་རྗེས་སུ་སྟོན་པ་དེ་དག་ཀྱང་ཟིལ་གྱིས་གནོན་ཏོ།
en: Because they dedicate the perfection of discipline toward the state of omniscience, they even surpass those who instruct and teach them. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན། མི་ལ་ལ་མེ་ཆུང་ངུའི་ནང་དུ་རྩྭ་དང་། ཤིང་དང་། ལྕི་བ་རྣམས་འཇུག་ན། དེ་ཇི་ལྟ་ཇི་ལྟར་འཇུག་པ་དེ་ལྟ་དེ་ལྟར་དེའི་རྒྱུ་ལས་མེ་དེ་མཆེད་པར་འགྱུར་རོ།
en: Venerable Pūrṇa, as an analogy, if a person throws grass, wood, and cow dung on a fire, the more of these he throws on the fire, the more they cause the fire to blaze up.

source: །ཇི་ལྟ་ཇི་ལྟར་མེ་དེ་མཆེད་པ་དེ་ལྟ་དེ་ལྟར་མེའི་ཕུང་པོ་དེ་ཤིན་ཏུ་ཆེ་བར་འགྱུར་ཏེ། དེས་དཔག་ཚད་མང་པོ། དཔག་ཚད་བརྒྱ་ཕྲག་མང་པོ་དང་། དཔག་ཚད་སྟོང་ཕྲག་མང་པོ་རྣམས་སྲེག་ཅིང་སྣང་བར་བྱེད་དོ། །
en: The more the fire blazes, the more the mass of fire will expand, gradually setting alight and incinerating several leagues, or even hundreds or thousands of leagues.

source: ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་གལ་ཏེ་ཉན་ཐོས་དཔག་ཏུ་མེད་པས། བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་འདོམས་ཤིང་རྗེས་སུ་སྟོན་ན། ཇི་ལྟ་ཇི་ལྟར་ཉན་ཐོས་དཔག་ཏུ་མེད་པས་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་འདོམས་ཤིང་རྗེས་སུ་སྟོན་པ་དེ་ལྟ་དེ་ལྟར། འདི་ལྟ་སྟེ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བའི་ཕྱིར། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྣང་བ་དཔག་ཏུ་མེད་པར་འགྱུར་རོ།
en: Venerable Pūrṇa, likewise, when countless hearers instruct and teach the perfection of discipline to bodhisattvas, the more these countless hearers instruct and teach the perfection of discipline to bodhisattvas, the more boundless their experience of the perfection of discipline becomes as they dedicate the merit toward the state of omniscience.

source: །ཇི་ལྟ་ཇི་ལྟར་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྣང་བ་དཔག་ཏུ་མེད་པ་དེ་ལྟ་དེ་ལྟར། བྱང་ཆུབ་སེམས་དཔའ་ལ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་འདོམས་པའི་ཉན་ཐོས་གཞན་གང་ཡིན་པ་དག་གིས་ཟིལ་གྱིས་ནོན་པར་མི་འགྱུར་ཏེ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བའི་ཕྱིར་རོ།
en: The more boundless their experience of the perfection of discipline becomes, the less any hearers who teach them the perfection of discipline will be able to surpass them, since they dedicate the merit toward the state of omniscience. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན། མི་ཞིག་གིས་གསེར་གྱི་འབྱུང་ཁུང་ནས་གསེར་བླངས་ཏེ། དེས་གསེར་དེ་བླངས་ནས་བདག་ཉིད་ཀྱང་བཙོངས་ལ།
en: Venerable Pūrṇa, as an analogy, suppose certain people extract gold from a gold mine and proceed to sell the gold as well as their services.

source: གསེར་དེ་ཡང་བཙོངས་ན། དེས་གསེར་དེ་བཙོངས་པའི་རིན་ནི་ཆེས་ཆེ་བ་ཡིན་གྱི། གང་གིས་གསེར་བླངས་པའི་མི་དེའི་ནི་མ་ཡིན་ནོ།
en: In that case the value of the gold will be very high, but the value of those who excavated the gold will not.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་ཇི་ལྟ་ཇི་ལྟར་ཉན་ཐོས་དཔག་ཏུ་མེད་པ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་འདོམས་ཤིང་རྗེས་སུ་སྟོན་པ་དེ་ལྟ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དཔག་ཏུ་མེད་ཅིང་ཆེས་རིན་ཐང་མེད་པར་འགྱུར་ཏེ།
en: Venerable Pūrṇa, likewise, when countless hearers instruct and offer teachings on the bodhisattvas’ perfection of discipline, it only makes this perfection of discipline become more boundless and priceless.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་ཉན་ཐོས་དེ་དག་གིས་ཚུལ་ཁྲིམས་ཀྱིས་ཀྱང་ཟིལ་གྱིས་ནོན་པར་མི་འགྱུར་ལ། བྱང་ཆུབ་སེམས་དཔས་ནི་ཉན་ཐོས་དེ་དག་ཚུལ་ཁྲིམས་ཀྱིས་ཟིལ་གྱིས་གནོན་པར་འགྱུར་ཏེ། འདི་ལྟར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བའི་ཕྱིར་རོ། །
en: In this way, since the bodhisattvas dedicate the merit toward the state of omniscience, the hearers are unable to surpass their discipline. The bodhisattvas, on the other hand, will surpass the hearers through their discipline.”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་འམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའི་གང་ཟག་འདོམས་ཤིང་རྗེས་སུ་སྟོན་པ་གང་ཡིན་པ་དེ་ཉིད། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཟིལ་གྱིས་གནོན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་རྒྱ་ཆེན་པོ་དང་ལྡན་པ་ཡིན་ཏེ། འདི་ལྟ་སྟེ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བའི་ཕྱིར་རོ།
en: Venerable Pūrṇa said, “Venerable Śāradvatīputra, the fact that bodhisattva great beings are able to surpass people from the vehicles of the hearers and the solitary buddhas who teach and instruct them shows that bodhisattva great beings possess vast qualities, derived from dedicating the perfection of discipline to the state of omniscience.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། ཚེ་དང་ལྡན་པ་གང་པོས་བཤད་པ་ལ་མངོན་པར་རྗེས་སུ་ཡི་རང་ནས་ཚེ་དང་ལྡན་པ་དེ་དེ་བཞིན་ཏེ།
en: Venerable Śāradvatīputra rejoiced in Venerable Pūrṇa’s remarks and said, “Venerable One, that is correct.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་ཆོས་རྒྱ་ཆེན་པོ་དང་ལྡན་པ་ཡིན་ནོ་ཞེས་སྨྲས་སོ།
en: Bodhisattva great beings do indeed possess vast qualities.”

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ལེའུ་གཉིས་པའོ།། །།
en: This is the second chapter from “The Perfection of Discipline.”

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་གཞན་ཡང་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་ལ་སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ན། གལ་ཏེ་བྱེད་པ་པོའི་ཆོས་འགའ་ཞིག་ཡང་དག་པར་རྗེས་སུ་མཐོང་ན། དེ་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ལ་གནས་པར་རིག་པར་བྱ་བ་མ་ཡིན་ཏེ།
en: Once again, Venerable Śāradvatīputra spoke to Venerable Pūrṇa Maitrāyaṇīputra, “Venerable Pūrṇa, if bodhisattva great beings perceive an agent while practicing the perfection of discipline, they are not following the Dharma of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་སྤོང་ཞིང་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པས་སྤྱོད་དོ།
en: Rather, they have abandoned the Dharma of the bodhisattvas and are engrossed in incorrect thinking.

source: །དེའི་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་གང་ཡིན་པ་དེ་ནི། དེའི་འཆལ་པའི་ཚུལ་ཁྲིམས་ཞེས་བྱའོ། །
en: That type of incorrect thinking should be recognized as a lapse in discipline.”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་གང་བྱེད་པ་པོའི་ཆོས་འགའ་ཡང་། ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ཞིང་། དེ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་དག་པར་བླངས་ནས་འདུག་ན། ཆོས་གང་ལ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཕན་འདོགས་པའམ། གནོད་པར་འགྱུར།
en: Venerable Pūrṇa asked, “Venerable Śāradvatīputra, if bodhisattva great beings do not perceive any agent while observing the perfection of discipline, can that perfection of discipline either benefit or harm anything?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི། ཆོས་གང་ལ་ཡང་ཕན་འདོགས་པའམ། གནོད་པར་བྱེད་པ་མ་ཡིན་ནོ།
en: Venerable Śāradvatīputra said, “Venerable Pūrṇa, the perfection of discipline neither benefits nor harms any phenomenon.

source: །གལ་ཏེ་ཆོས་འགའ་ཞིག་ལ་ཕན་འདོགས་པའམ། གནོད་པ་བྱེད་པར་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ན། བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་མཆོག་ཏུ་འཛིན་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: When bodhisattvas can perceive neither benefit nor harm being done to any phenomenon, that is the supreme observance of discipline of a bodhisattva.

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔས་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཆོས་འགའ་ལ་ཕན་འདོགས་པའམ། གནོད་པར་འགྱུར་བའི་ཆོས་འགའ་ཞིག་ཡང་དག་པར་རྗེས་སུ་མཐོང་ན། བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་མ་ཡིན་ནོ།
en: If bodhisattvas perceive any phenomenon that their perfection of discipline can either benefit or harm, then those bodhisattvas are not upholding the perfection of discipline.

source: །བྱེད་པ་པོ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ན། བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་སྟེ།
en: When no agent is perceived, that is the bodhisattvas’ perfection of discipline.

source: ཚུལ་ཁྲིམས་དེ་ཡང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པའི་ཕྱིར་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: Moreover, as their discipline is dedicated toward omniscience, it is called the perfection of discipline. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་གང་དང་གང་ཡོངས་སུ་བཏང་ནས། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་ན། བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་དང་ལྡན་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: Venerable Pūrṇa, if bodhisattvas dedicate any act of generosity toward omniscience, those bodhisattvas should be recognized as observing discipline.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་གང་དང་གང་སྲུང་བ་དེ་ཡང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་ན། བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་དང་ལྡན་པ་ཡིན་པར་རིག་པར་བྱའོ། །
en: Also, Venerable Pūrṇa, if bodhisattvas dedicate any discipline that they observe toward omniscience, those bodhisattvas should be recognized as observing discipline.

source: ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཕ་རོལ་གྱིས་སྤྱོས་སམ། བརྒྱད་བཀག་ཀྱང་རུང་སྟེ། བཟོད་པར་བྱེད་ཅིང་། བཟོད་པ་དེ་ཡང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་ན། བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་དང་ལྡན་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: Moreover, Venerable Pūrṇa, if bodhisattvas remain patient whenever they are criticized or rebuked, and subsequently dedicate the merit from that patience toward omniscience, those bodhisattvas should be recognized as observing discipline.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་གཞན་དག་དང་། གང་ཟག་གཞན་རྣམས་ཀྱི་ཆེད་དུ་རྩོལ་བར་བྱེད་ལ། བརྩོན་འགྲུས་དེའང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་ན། བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་དང་ལྡན་པ་ཞེས་བྱའོ།
en: Venerable Pūrṇa, likewise, if bodhisattvas work hard for the sake of others and subsequently dedicate the merit from that diligence toward omniscience, those bodhisattvas are said to be observing discipline.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་བསམ་གཏན་གང་དང་གང་སྐྱེད་པ་དེ་བཞིན་དུ། བསམ་གཏན་འདི་དག་བསྐྱེད་ནས། རྫུ་འཕྲུལ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Venerable Pūrṇa, moreover, bodhisattvas may develop concentration and thereafter accomplish miraculous abilities.

source: །རྫུ་འཕྲུལ་དེས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་ལ་འཇུག་ཅིང་ཤེས་པར་བྱའོ།
en: With these miraculous abilities they will be able to know and perceive the mental acts of others.

source: །དེ་ནས་སྣོད་དུ་གྱུར་པར་བྱའོ་སྙམ་སྟེ། སེམས་ཀྱི་ཁྱད་པར་དེ་དག་ཐམས་ཅད་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་ན། བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་དང་ལྡན་པ་ཡིན་པར་རིག་པར་བྱའོ། །
en: If in this way they attempt to make them suitable recipients for the teaching and dedicate the merit toward omniscience, those bodhisattvas should be recognized as observing discipline.

source: ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་གང་དང་གང་ལ་སྤྱོད་ཅིང་། ཕུང་པོ་ལ་མཁས་པའམ། ཁམས་ལ་མཁས་པའམ། སྐྱེ་མཆེད་ལ་མཁས་པའམ། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་མཁས་པའམ། གནས་དང་གནས་མ་ཡིན་པ་ལ་མཁས་པའམ། མཉམ་པ་ཉིད་དུ་འདུ་ཤེས་ནས་འདུ་ཤེས་ཐམས་ཅད་སྤང་བའི་ཕྱིར་ཆོས་བསྟན་པར་བྱའོ་སྙམ་སྟེ།
en: Venerable Pūrṇa, bodhisattvas may practice insight and may think they should teach the Dharma in order to make others learned about the aggregates, elements, sense fields, dependent origination, or the correct and the incorrect, and to make them give up all notions by means of the notion of sameness.

source: སེམས་བསྐྱེད་པ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་ན། བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་དང་ལྡན་པ་ཡིན་པར་རིག་པར་བྱའོ། །བླ་ན་མེད་པའི་ཚུལ་ཁྲིམས་དང་ལྡན་པར་རིག་པར་བྱའོ།
en: If, at that point, they dedicate all such intentions to the state of omniscience, those bodhisattvas should be recognized as observing not just discipline, but unsurpassed discipline.

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་བའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་ནི་ཉན་ཐོས་གང་གིས་ཀྱང་ཚུལ་ཁྲིམས་ཀྱིས་ཟིལ་གྱིས་གནོན་ནུས་པ་གང་ཡང་མེད་དོ།
en: If bodhisattvas dedicate all six perfections of the bodhisattvas toward the state of omniscience, no hearer anywhere will be able to surpass them in terms of discipline. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་གལ་ཏེ་སེམས་ཅན་ཐམས་ཅད་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་ལྡན་པར་གྱུར་ན། དེ་དག་གི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཐེག་པ་ལ་དང་པོ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་དང་པོ་བསྐྱེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས་རྒྱུའི་བར་དུ་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: Venerable Pūrṇa, moreover, even if all beings were to follow the path of the ten virtuous actions, the entire discipline that they would observe would not constitute even one percent of the discipline practiced by a bodhisattva who had just entered the Great Vehicle and developed the mind of awakening for the very first time. Nor would it measure a thousandth, a hundred thousandth, a millionth, or a trillionth of that. In fact, no number, fraction, enumeration, analogy, or comparison would suffice.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་གལ་ཏེ་སེམས་ཅན་ཐམས་ཅད་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པར་གྱུར་ན། དེ་དག་གི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི། ཐེག་པ་ལ་དང་པོ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་དང་པོ་བསྐྱེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས། རྒྱུའི་བར་དུ་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: “Venerable Pūrṇa, moreover, even if all beings possessed the five superknowledges, the entire discipline that they would observe would not constitute even one percent of the discipline practiced by a bodhisattva who had just entered the Great Vehicle and developed the mind of awakening for the very first time. Nor would it measure a thousandth, a hundred thousandth, a millionth, or a trillionth of that. In fact, no number, fraction, enumeration, analogy, or comparison would suffice. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་གལ་ཏེ་སེམས་ཅན་ཐམས་ཅད་བྱམས་པ་ལ་གནས་པར་གྱུར། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ལ་གནས་པར་གྱུར་ན། དེ་དག་གི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ཡང་ཐེག་པ་ལ་དང་པོ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་དང་པོ་བསྐྱེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས། རྒྱུའི་བར་དུ་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: Venerable Pūrṇa, moreover, even if all beings were filled with love, compassion, joy, and equanimity, the entire discipline that they would observe would not constitute even one percent of the discipline practiced by a bodhisattva who had just entered the Great Vehicle and developed the mind of awakening for the very first time. Nor would it measure a thousandth, a hundred thousandth, a millionth, or a trillionth of that. In fact, no number, fraction, enumeration, analogy, or comparison would suffice. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་གལ་ཏེ་སེམས་ཅན་ཐམས་ཅད་སྟོང་པ་ཉིད་ཀྱི་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་དང་ལྡན་པར་གྱུར་ན། དེ་དག་གི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཐེག་པ་ལ་དང་པོ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་དང་པོ་བསྐྱེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས། རྒྱུའི་བར་དུ་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: Venerable Pūrṇa, moreover, even if all beings possessed the patience that is in harmony with emptiness, the entire discipline that they would observe would not constitute even one percent of the discipline practiced by a bodhisattva who had just entered the Great Vehicle and developed the mind of awakening for the very first time. Nor would it measure a thousandth, a hundred thousandth, a millionth, or a trillionth of that. In fact, no number, fraction, enumeration, analogy, or comparison would suffice. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་གལ་ཏེ་སེམས་ཅན་ཐམས་ཅད་མཚན་མ་མེད་པའི་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་དང་ལྡན་པར་གྱུར་ན། དེ་དག་གི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཐེག་པ་ལ་དང་པོ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་དང་པོ་བསྐྱེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས་རྒྱུའི་བར་དུ་ཡང་ཉེ་བར་མི་འགྲོའོ། །
en: Venerable Pūrṇa, moreover, even if all beings possessed the patience that is in harmony with signlessness, the entire discipline that they would observe would not constitute even one percent of the discipline practiced by a bodhisattva who had just entered the Great Vehicle and developed the mind of awakening for the very first time. Nor would it measure a thousandth, a hundred thousandth, a millionth, or a trillionth of that. In fact, no number, fraction, enumeration, analogy, or comparison would suffice.

source: ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་གལ་ཏེ་སེམས་ཅན་ཐམས་ཅད་སྨོན་པ་མེད་པའི་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་དང་ལྡན་པར་གྱུར་ན། དེ་དག་གི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཐེག་པ་ལ་དང་པོ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་དང་པོ་བསྐྱེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས་རྒྱུའི་བར་དུ་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: “Venerable Pūrṇa, moreover, even if all beings possessed the patience that is in harmony with wishlessness, the entire discipline that they would observe would not constitute even one percent of the discipline practiced by a bodhisattva who had just entered the Great Vehicle and developed the mind of awakening for the very first time. Nor would it measure a thousandth, a hundred thousandth, a millionth, or a trillionth of that. In fact, no number, fraction, enumeration, analogy, or comparison would suffice. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་གལ་ཏེ་སེམས་ཅན་ཐམས་ཅད་བརྒྱད་པར་གྱུར་ན། དེ་དག་གི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཐེག་པ་ལ་དང་པོ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་དང་པོ་བསྐྱེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས་རྒྱུའི་བར་དུ་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: Venerable Pūrṇa, moreover, even if all beings reached the eighth-lowest level, the entire discipline that they would observe would not constitute even one percent of the discipline practiced by a bodhisattva who had just entered the Great Vehicle and developed the mind of awakening for the very first time. Nor would it measure a thousandth, a hundred thousandth, a millionth, or a trillionth of that. In fact, no number, fraction, enumeration, analogy, or comparison would suffice.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གལ་ཏེ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་བདག་གི་དྲི་བ་དྲིས་པ་ལན་གདབ་པའི་སྐབས་ཕྱེ་ན།
en: At that point, Venerable Pūrṇa Maitrāyaṇīputra said to Venerable Śāradvatīputra, “Venerable Śāradvatīputra, if you would be so kind as to address my inquiries, then, Venerable One, I would like to ask you some questions.”

source: ཚེ་དང་ལྡན་པ་ལ་བདག་ཕྱོགས་འགའ་ཞིག་འདྲིའོ། །སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་དྲིས་ཤིག་དང་ཐོས་པའི་དོན་བརྡ་སྤྲད་པར་བྱའོ།
en: Venerable Śāradvatīputra said, “Venerable Pūrṇa, please ask! Then I shall tell you what I have heard.”

source: །སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཇི་གཟུགས་བརྒྱད་པ་ཡིན་པར་འདོད་དམ།
en: Venerable Pūrṇa then asked, “Venerable Śāradvatīputra, do you assert the results of the eighth-lowest level to be form?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་དེ་ནི་མ་ཡིན་ནོ།
en: Venerable Śāradvatīputra said, “No, Venerable Pūrṇa, I do not.”

source: །སྨྲས་པ། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་བརྒྱད་པ་ཡིན་པར་འདོད་དམ།
en: Venerable Pūrṇa asked, “Venerable Śāradvatīputra, do you assert the eighth-lowest level to be feeling, perception, formation, and consciousness?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་དེ་ནི་མ་ཡིན་ནོ། །
en: Venerable Śāradvatīputra said, “No, Venerable Pūrṇa, I do not.”

source: སྨྲས་པ། དེ་ལས་གཞན་པའི་ཆོས་རྣམས་ལ་བརྒྱད་པར་འདོད་དམ།
en: Venerable Pūrṇa asked, “Is there any other phenomenon that you would assert to be the eighth-lowest level?”

source: །སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འོ་ན་བརྒྱད་པ་དེ་གང་ཡིན་པར་འདོད།
en: Venerable Pūrṇa asked, “Venerable Śāradvatīputra, well, what then do you assert the eighth-lowest level to be?

source: བདག་གིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་བཤད་པའི་དོན་དེ་ཇི་ལྟ་བུར་ཤེས་པར་བྱ།
en: How should I understand the meaning of what you have said, Śāradvatīputra?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་ཆོས་འདི་རྣམས་ཀྱི་མཉམ་པ་ཉིད་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་མི་ཤེས་པ་དེ་ལ་ཤེས་པ་གང་གིས་མཉམ་པ་ཉིད་དེ་མངོན་སུམ་དུ་བྱེད་པའི་ཤེས་པ་དེ་ནི་བྱ་བ་བྱས་པའི་ཕྱིར་ཐོབ་པ་ཡིན་ཏེ།
en: Venerable Śāradvatīputra said, “Venerable Pūrṇa, the knowledge that understands sameness—the sameness of all these phenomena, which is unknown to all beings—is the attainment of having done what needs to be done.

source: དེ་ལ་བརྒྱད་པ་ནི་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Those at the eighth-lowest level do not properly perceive this.

source: །གལ་ཏེ་གནས་འདི་རྙེད་ན་ནི་མཉམ་པ་ཉིད་ཤེས་པ་འདི་ལ་བརྟག་ཅིང་བརྒལ་བ་མེད་དོ།
en: If you attain such a level, there is no examination or transcendence associated with the knowledge of sameness.”

source: །སྨྲས་པ། འདི་སྐད་དུ་བརྒྱད་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཀྱི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས། རྒྱུའི་བར་དུའང་ཉེ་བར་མི་འགྲོའོ་ཞེས་ཀྱང་ཟེར་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་སྔ་མ་དང་ཕྱི་མ་དང་། ཕྱི་མ་དང་སྔ་མ་ཇི་ལྟར་འཐུན་པར་འགྱུར།
en: Venerable Pūrṇa said, “So, Venerable Śāradvatīputra, how can you relate the former and the latter? You said that the discipline related to those at the eighth-lowest level does not constitute even one percent of the discipline of the bodhisattvas. Nor does it measure a thousandth, a hundred thousandth, a millionth, or a trillionth of that. In fact, no number, fraction, enumeration, analogy, or comparison would suffice.”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་བརྒྱད་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཀྱི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས། རྒྱུའི་བར་དུ་ཡང་ཉེ་བར་མི་འགྲོའོ་ཞེས་བྱ་བ་དེ་ནི་ཇི་ལྟར་ལས་དང་པོ་པ་ལ་བཤད་པ་དེ་ལྟར་བསྟན་ཏོ།
en: Venerable Śāradvatīputra said, “Venerable Pūrṇa, I did say that ‘the discipline related to the eighth-lowest level does not even constitute one percent of the discipline of the bodhisattvas. Nor does it measure a thousandth, a hundred thousandth, a millionth, or a trillionth of that. In fact, no number, fraction, enumeration, analogy or comparison would suffice.’

source: །ཅི་ནས་སེམས་ཅན་རྣམས་འཇུག་པར་འགྱུར་བ་དེ་ལྟར་བསྟན་ཏོ།
en: When I said that, I was teaching it in the way that it is introduced to beings.

source: །ཅི་ནས་སྐྱེ་བོ་མང་པོས་གོ་བར་འགྱུར་བ་དེ་ལྟར་བསྟན་ཏོ།
en: I was teaching it in a way that many beings would understand.

source: །ཅི་ནས་ཐེག་པ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཐེག་པ་འབར་བར་འགྱུར་བ་དེ་ལྟར་བསྟན་ཏོ།
en: I was teaching it that way so that the Great Vehicle and the vehicle of the buddhas will flourish.

source: །བརྒྱད་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཐེག་པ་ལ་དང་པོ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་དང་པོ་བསྐྱེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས། རྒྱུའི་བར་དུ་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: So that is why I said that the discipline related to the eighth-lowest level does not constitute even one percent of the discipline of the bodhisattvas. Nor does it measure a thousandth, a hundred thousandth, a millionth, or a trillionth of that. In fact, no number, fraction, enumeration, analogy, or comparison would suffice. “
